# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [32]:
frist = pd.Series(np.random.randint(1,4,100))
second = pd.Series(np.random.randint(1,3,100))
third = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [36]:
dataframe = pd.concat([frist,second,third],axis=1)
dataframe

    0  1      2
0   1  1  11970
1   3  1  22631
2   3  1  29558
3   2  2  17776
4   3  1  11492
.. .. ..    ...
95  1  2  20695
96  2  2  15139
97  3  2  14915
98  3  2  15682
99  3  2  12261

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [38]:
dataframe.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
dataframe

    bedrs  bathrs  price_sqr_meter
0       1       1            11970
1       3       1            22631
2       3       1            29558
3       2       2            17776
4       3       1            11492
..    ...     ...              ...
95      1       2            20695
96      2       2            15139
97      3       2            14915
98      3       2            15682
99      3       2            12261

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [40]:
bigcolumn = pd.concat([frist, second, third], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       3
2       3
3       2
4       3
..    ...
95  20695
96  15139
97  14915
98  15682
99  12261

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [41]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [43]:
bigcolumn.reset_index(drop=True,inplace=True)

In [44]:
bigcolumn

         0
0        1
1        3
2        3
3        2
4        3
..     ...
295  20695
296  15139
297  14915
298  15682
299  12261

[300 rows x 1 columns]